ИнтеграцияСSelSupБухгалтерия_cfe/InformationRegisters/SS_КлючиAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SS_КлючиAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МеткаКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ИнтеграцияСSelSupБухгалтерия_cfe/CommonModules/SS_МодульОбменаСSelSup/Ext/Module.bsl
Процедура ОбновитьОстаткиНаSelSup() Экспорт
	
	ЗаписьЖурналаРегистрации("ИнтеграцияСSelSup.ОбновлениеОстатковНаСайте", УровеньЖурналаРегистрации.Информация, , , "Запущено регламентное обновление остатков.");	  
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	SS_КлючиAPI.КлючAPI КАК КлючAPI
	|ИЗ
	|	РегистрСведений.SS_КлючиAPI КАК SS_КлючиAPI
	|ГДЕ
	|	SS_КлючиAPI.Использовать");
	
	ТаблицаКлючейAPI = Запрос.Выполнить().Выгрузить();
	Если ТаблицаКлючейAPI.Количество() > 0 Тогда  
		SS_Обработка = Обработки.SS_ОбменSelSup_УТ.Создать();
		SS_Обработка.ApiKey = ТаблицаКлючейAPI[0].КлючAPI;  
		SS_Обработка.ОбновитьОстаткиНаСайте();
	Иначе
		ЗаписьЖурналаРегистрации("ИнтеграцияСSelSup.ОбновлениеОстатковНаСайте", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при получении ключа API");	
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ИнтеграцияСSelSup.ОбновлениеОстатковНаСайте", УровеньЖурналаРегистрации.Информация, , , "Завершено регламентное обновление остатков.");
	
КонецПроцедуры
